---
kind: type
id: T:Autodesk.Revit.DB.Mechanical.SpaceTag
source: html/ef54adf0-d922-e041-0e8c-34cff3ebdb8f.htm
---
# Autodesk.Revit.DB.Mechanical.SpaceTag

Provides access to the space tag in Autodesk Revit.

## Syntax (C#)
```csharp
public class SpaceTag : SpatialElementTag
```

## Remarks
The space Tag object can be queried for space information.